analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/ctb_regs.h
#define MXC_F_CTB_CIPHER_CTRL_CIPHER_POS               4 /**< CIPHER_CTRL_CIPHER Position */
#define MXC_F_CTB_CIPHER_CTRL_CIPHER                   ((uint32_t)(0x7UL << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS)) /**< CIPHER_CTRL_CIPHER Mask */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_DIS               ((uint32_t)0x0UL) /**< CIPHER_CTRL_CIPHER_DIS Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_DIS               (MXC_V_CTB_CIPHER_CTRL_CIPHER_DIS << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_DIS Setting */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_AES128            ((uint32_t)0x1UL) /**< CIPHER_CTRL_CIPHER_AES128 Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_AES128            (MXC_V_CTB_CIPHER_CTRL_CIPHER_AES128 << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_AES128 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_AES192            ((uint32_t)0x2UL) /**< CIPHER_CTRL_CIPHER_AES192 Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_AES192            (MXC_V_CTB_CIPHER_CTRL_CIPHER_AES192 << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_AES192 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_AES256            ((uint32_t)0x3UL) /**< CIPHER_CTRL_CIPHER_AES256 Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_AES256            (MXC_V_CTB_CIPHER_CTRL_CIPHER_AES256 << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_AES256 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_DES               ((uint32_t)0x4UL) /**< CIPHER_CTRL_CIPHER_DES Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_DES               (MXC_V_CTB_CIPHER_CTRL_CIPHER_DES << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_DES Setting */
#define MXC_V_CTB_CIPHER_CTRL_CIPHER_TDES              ((uint32_t)0x5UL) /**< CIPHER_CTRL_CIPHER_TDES Value */
#define MXC_S_CTB_CIPHER_CTRL_CIPHER_TDES              (MXC_V_CTB_CIPHER_CTRL_CIPHER_TDES << MXC_F_CTB_CIPHER_CTRL_CIPHER_POS) /**< CIPHER_CTRL_CIPHER_TDES Setting */

#define MXC_F_CTB_CIPHER_CTRL_MODE_POS                 8 /**< CIPHER_CTRL_MODE Position */
#define MXC_F_CTB_CIPHER_CTRL_MODE                     ((uint32_t)(0x7UL << MXC_F_CTB_CIPHER_CTRL_MODE_POS)) /**< CIPHER_CTRL_MODE Mask */
#define MXC_V_CTB_CIPHER_CTRL_MODE_ECB                 ((uint32_t)0x0UL) /**< CIPHER_CTRL_MODE_ECB Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_ECB                 (MXC_V_CTB_CIPHER_CTRL_MODE_ECB << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_ECB Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_CBC                 ((uint32_t)0x1UL) /**< CIPHER_CTRL_MODE_CBC Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_CBC                 (MXC_V_CTB_CIPHER_CTRL_MODE_CBC << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_CBC Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_CFB                 ((uint32_t)0x2UL) /**< CIPHER_CTRL_MODE_CFB Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_CFB                 (MXC_V_CTB_CIPHER_CTRL_MODE_CFB << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_CFB Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_OFB                 ((uint32_t)0x3UL) /**< CIPHER_CTRL_MODE_OFB Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_OFB                 (MXC_V_CTB_CIPHER_CTRL_MODE_OFB << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_OFB Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_CTR                 ((uint32_t)0x4UL) /**< CIPHER_CTRL_MODE_CTR Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_CTR                 (MXC_V_CTB_CIPHER_CTRL_MODE_CTR << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_CTR Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_GCM                 ((uint32_t)0x5UL) /**< CIPHER_CTRL_MODE_GCM Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_GCM                 (MXC_V_CTB_CIPHER_CTRL_MODE_GCM << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_GCM Setting */
#define MXC_V_CTB_CIPHER_CTRL_MODE_CCM                 ((uint32_t)0x6UL) /**< CIPHER_CTRL_MODE_CCM Value */
#define MXC_S_CTB_CIPHER_CTRL_MODE_CCM                 (MXC_V_CTB_CIPHER_CTRL_MODE_CCM << MXC_F_CTB_CIPHER_CTRL_MODE_POS) /**< CIPHER_CTRL_MODE_CCM Setting */

#define MXC_F_CTB_CIPHER_CTRL_HVC_POS                  11 /**< CIPHER_CTRL_HVC Position */
#define MXC_F_CTB_CIPHER_CTRL_HVC                      ((uint32_t)(0x1UL << MXC_F_CTB_CIPHER_CTRL_HVC_POS)) /**< CIPHER_CTRL_HVC Mask */

#define MXC_F_CTB_CIPHER_CTRL_DTYPE_POS                12 /**< CIPHER_CTRL_DTYPE Position */
#define MXC_F_CTB_CIPHER_CTRL_DTYPE                    ((uint32_t)(0x1UL << MXC_F_CTB_CIPHER_CTRL_DTYPE_POS)) /**< CIPHER_CTRL_DTYPE Mask */

#define MXC_F_CTB_CIPHER_CTRL_CCMM_POS                 13 /**< CIPHER_CTRL_CCMM Position */
#define MXC_F_CTB_CIPHER_CTRL_CCMM                     ((uint32_t)(0x7UL << MXC_F_CTB_CIPHER_CTRL_CCMM_POS)) /**< CIPHER_CTRL_CCMM Mask */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_4                   ((uint32_t)0x1UL) /**< CIPHER_CTRL_CCMM_4 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_4                   (MXC_V_CTB_CIPHER_CTRL_CCMM_4 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_4 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_6                   ((uint32_t)0x2UL) /**< CIPHER_CTRL_CCMM_6 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_6                   (MXC_V_CTB_CIPHER_CTRL_CCMM_6 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_6 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_8                   ((uint32_t)0x3UL) /**< CIPHER_CTRL_CCMM_8 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_8                   (MXC_V_CTB_CIPHER_CTRL_CCMM_8 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_8 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_10                  ((uint32_t)0x4UL) /**< CIPHER_CTRL_CCMM_10 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_10                  (MXC_V_CTB_CIPHER_CTRL_CCMM_10 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_10 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_12                  ((uint32_t)0x5UL) /**< CIPHER_CTRL_CCMM_12 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_12                  (MXC_V_CTB_CIPHER_CTRL_CCMM_12 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_12 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_14                  ((uint32_t)0x6UL) /**< CIPHER_CTRL_CCMM_14 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_14                  (MXC_V_CTB_CIPHER_CTRL_CCMM_14 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_14 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCMM_16                  ((uint32_t)0x7UL) /**< CIPHER_CTRL_CCMM_16 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCMM_16                  (MXC_V_CTB_CIPHER_CTRL_CCMM_16 << MXC_F_CTB_CIPHER_CTRL_CCMM_POS) /**< CIPHER_CTRL_CCMM_16 Setting */

#define MXC_F_CTB_CIPHER_CTRL_CCML_POS                 16 /**< CIPHER_CTRL_CCML Position */
#define MXC_F_CTB_CIPHER_CTRL_CCML                     ((uint32_t)(0x7UL << MXC_F_CTB_CIPHER_CTRL_CCML_POS)) /**< CIPHER_CTRL_CCML Mask */
#define MXC_V_CTB_CIPHER_CTRL_CCML_2                   ((uint32_t)0x1UL) /**< CIPHER_CTRL_CCML_2 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_2                   (MXC_V_CTB_CIPHER_CTRL_CCML_2 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_2 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_3                   ((uint32_t)0x2UL) /**< CIPHER_CTRL_CCML_3 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_3                   (MXC_V_CTB_CIPHER_CTRL_CCML_3 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_3 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_4                   ((uint32_t)0x3UL) /**< CIPHER_CTRL_CCML_4 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_4                   (MXC_V_CTB_CIPHER_CTRL_CCML_4 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_4 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_5                   ((uint32_t)0x4UL) /**< CIPHER_CTRL_CCML_5 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_5                   (MXC_V_CTB_CIPHER_CTRL_CCML_5 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_5 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_6                   ((uint32_t)0x5UL) /**< CIPHER_CTRL_CCML_6 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_6                   (MXC_V_CTB_CIPHER_CTRL_CCML_6 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_6 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_7                   ((uint32_t)0x6UL) /**< CIPHER_CTRL_CCML_7 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_7                   (MXC_V_CTB_CIPHER_CTRL_CCML_7 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_7 Setting */
#define MXC_V_CTB_CIPHER_CTRL_CCML_8                   ((uint32_t)0x7UL) /**< CIPHER_CTRL_CCML_8 Value */
#define MXC_S_CTB_CIPHER_CTRL_CCML_8                   (MXC_V_CTB_CIPHER_CTRL_CCML_8 << MXC_F_CTB_CIPHER_CTRL_CCML_POS) /**< CIPHER_CTRL_CCML_8 Setting */

#define MXC_F_CTB_CIPHER_CTRL_PUFKEYSEL_POS            19 /**< CIPHER_CTRL_PUFKEYSEL Position */
#define MXC_F_CTB_CIPHER_CTRL_PUFKEYSEL                ((uint32_t)(0x1UL << MXC_F_CTB_CIPHER_CTRL_PUFKEYSEL_POS)) /**< CIPHER_CTRL_CCML Mask */
#define MXC_V_CTB_CIPHER_CTRL_PUFKEYS_KEY0             ((uint32_t)0x0UL) /**< CIPHER_CTRL_PUFKEYS_KEY0 Value */
#define MXC_S_CTB_CIPHER_CTRL_PUFKEYS_KEY0             (MXC_V_CTB_CIPHER_CTRL_PUFKEYS_KEY0 << MXC_F_CTB_CIPHER_CTRL_PUFKEYSEL_POS) /**< CIPHER_CTRL_PUFKEYS_KEY0 Setting */
#define MXC_V_CTB_CIPHER_CTRL_PUFKEYS_KEY1             ((uint32_t)0x1UL) /**< CIPHER_CTRL_PUFKEYS_KEY1 Value */
#define MXC_S_CTB_CIPHER_CTRL_PUFKEYS_KEY1             (MXC_V_CTB_CIPHER_CTRL_PUFKEYS_KEY1 << MXC_F_CTB_CIPHER_CTRL_PUFKEYSEL_POS) /**< CIPHER_CTRL_PUFKEYS_KEY0 Setting */

/**@} end of group CTB_CIPHER_CTRL_Register */

/**
 * @ingroup  ctb_registers
 * @defgroup CTB_HASH_CTRL CTB_HASH_CTRL
 * @brief    HASH Control Register.
 * @{
 */
#define MXC_F_CTB_HASH_CTRL_INIT_POS                   0 /**< HASH_CTRL_INIT Position */
#define MXC_F_CTB_HASH_CTRL_INIT                       ((uint32_t)(0x1UL << MXC_F_CTB_HASH_CTRL_INIT_POS)) /**< HASH_CTRL_INIT Mask */

#define MXC_F_CTB_HASH_CTRL_XOR_POS                    1 /**< HASH_CTRL_XOR Position */
#define MXC_F_CTB_HASH_CTRL_XOR                        ((uint32_t)(0x1UL << MXC_F_CTB_HASH_CTRL_XOR_POS)) /**< HASH_CTRL_XOR Mask */

